## Plan Result (MailrelayDev)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;mailrelay&#34;]
  * azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;mailrelay2&#34;]
  * azurerm_role_assignment.acme_kv[&#34;mailrelay&#34;]
  * azurerm_role_assignment.acme_kv[&#34;mailrelay2&#34;]
  * azurerm_user_assigned_identity.managed_identity[&#34;mailrelay&#34;]
  * azurerm_user_assigned_identity.managed_identity[&#34;mailrelay2&#34;]
* Update
  * module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_access_policy.managed_identity_access_policy
  * azurerm_role_assignment.acme_kv
  * azurerm_user_assigned_identity.managed_identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.managed_identity_access_policy will be destroyed
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev/objectId/b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev" -> null
      - object_id               = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.managed_identity_access_policy["mailrelay"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.managed_identity_access_policy["mailrelay2"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_role_assignment.acme_kv will be destroyed
  - resource "azurerm_role_assignment" "acme_kv" {
      - id                   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod/providers/Microsoft.Authorization/roleAssignments/0f9bcd49-f6ce-2797-83f4-eab42d222ccf" -> null
      - name                 = "0f9bcd49-f6ce-2797-83f4-eab42d222ccf" -> null
      - principal_id         = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod" -> null
    }

  # azurerm_role_assignment.acme_kv["mailrelay"] will be created
  + resource "azurerm_role_assignment" "acme_kv" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme_kv["mailrelay2"] will be created
  + resource "azurerm_role_assignment" "acme_kv" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.managed_identity will be destroyed
  - resource "azurerm_user_assigned_identity" "managed_identity" {
      - client_id           = "8fb619a4-44cb-454e-ab38-fefb9bf49b94" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mailrelay-stg-mi" -> null
      - location            = "uksouth" -> null
      - name                = "mailrelay-stg-mi" -> null
      - principal_id        = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - resource_group_name = "managed-identities-stg-rg" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-mailrelay"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "development"
        } -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_user_assigned_identity.managed_identity["mailrelay"] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "mailrelay-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-mailrelay"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.managed_identity["mailrelay2"] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "mailrelay2-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-mailrelay"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id           = (known after apply)
    }

  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev|sds-mailrelay-dev"
        name                           = "sds-mailrelay-dev"
        # (3 unchanged attributes hidden)



      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 3 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_role_assignment.acme_kv[0] has been deleted
  - resource "azurerm_role_assignment" "acme_kv" {
      - id                   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod/providers/Microsoft.Authorization/roleAssignments/0f9bcd49-f6ce-2797-83f4-eab42d222ccf" -> null
      - name                 = "0f9bcd49-f6ce-2797-83f4-eab42d222ccf" -> null
      - principal_id         = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod" -> null
    }
  # azurerm_user_assigned_identity.managed_identity[0] has been deleted
  - resource "azurerm_user_assigned_identity" "managed_identity" {
      - client_id           = "8fb619a4-44cb-454e-ab38-fefb9bf49b94" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mailrelay-stg-mi" -> null
      - location            = "uksouth" -> null
      - name                = "mailrelay-stg-mi" -> null
      - principal_id        = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - resource_group_name = "managed-identities-stg-rg" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-mailrelay"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "development"
        } -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }
  # azurerm_key_vault_access_policy.managed_identity_access_policy[0] has been deleted
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev/objectId/b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev" -> null
      - object_id               = "b80d6478-5c73-432d-8a05-1d3df0e11dd9" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }
  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-mailrelay-dev-rg/providers/Microsoft.KeyVault/vaults/sds-mailrelay-dev|sds-mailrelay-dev"
        name                           = "sds-mailrelay-dev"
        # (3 unchanged attributes hidden)



      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"MailrelayDev","Vars":{}} -->